# Реализовать вывод информации о промежутке времени в зависимости от его продолжительности duration в секундах:
# до минуты: <s> сек;
# до часа: <m> мин <s> сек;
# до суток: <h> час <m> мин <s> сек;
# * в остальных случаях: <d> дн <h> час <m> мин <s> сек.

print("Введіть час в секундах")
sec = int(input())
day_s = sec // 86400
hour_s = (sec % 86400) // 3600
min_s = ((sec % 86400) % 3600) // 60
sec =  ((sec % 86400) % 3600) % 60
if day_s == 0:
    if hour_s == 0:
        if min_s == 0:
            print(sec, "сек")
        else: print(min_s, "мін", sec, "сек")
    else: print(hour_s, "год", min_s, "мін", sec, "сек")
else: print(day_s, "дн", hour_s, "год", min_s, "мін", sec, "сек")